---
kind: other
id: Methods.T:Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException
source: html/a0fc8d06-7663-97ff-bd1a-91452c7e47b8.htm
---
# ForbiddenForDynamicUpdateException Methods

Retrieves data needed to serialize the target object.